Revit 2024 API
RebarHostData.GetPathReinforcementsInHost Method
 Returns all PathReinforcement elements hosted by the referenced element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public IList<PathReinforcement> GetPathReinforcementsInHost()
Visual Basic
Public Function GetPathReinforcementsInHost As IList(Of PathReinforcement)
Visual C++
public:
IList<PathReinforcement^>^ GetPathReinforcementsInHost()
See Also
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace